In [2]:
import pandas as pd

In [86]:
df = pd.DataFrame({'Yes': [50,21,10,10], 'No':[131,2,6,8]})

In [44]:
df1 = pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland']})

In [57]:
df

   Yes   No
0   50  131
1   21    2
2    3    6
3    2    8

In [46]:
df1

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.         Bland

In [35]:
df_csv = pd.read_csv("/Users/jinyang/Desktop/Institute_of_Data/IOD_2020_Github/data/AirPassengers.csv")

In [55]:
df_csv.head()

  TravelDate  Passengers
0   1/1/1949         112
1   2/1/1949         118
2   3/1/1949         132
3   4/1/1949         129
4   5/1/1949         121

In [37]:
df_csv.shape

(144, 2)

In [51]:
df_csv.describe()

       Passengers
count  144.000000
mean   280.298611
std    119.966317
min    104.000000
25%    180.000000
50%    265.500000
75%    360.500000
max    622.000000

In [39]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   TravelDate  144 non-null    object
 1   Passengers  144 non-null    int64
dtypes: int64(1), object(1)
memory usage: 2.4+ KB

In [40]:
df_csv.Passengers.describe()

count    144.000000
mean     280.298611
std      119.966317
min      104.000000
25%      180.000000
50%      265.500000
75%      360.500000
max      622.000000
Name: Passengers, dtype: float64

In [41]:
type(df_csv)

pandas.core.frame.DataFrame

In [47]:
series = df['Yes']

In [49]:
series

0    50
1    21
Name: Yes, dtype: int64

In [62]:
df

   Yes   No
0   50  131
1   21    2
2    3    6
3    2    8

In [59]:
df['No']

0    131
1      2
2      6
3      8
Name: No, dtype: int64

In [60]:
df['No'][1]

2

In [63]:
df.iloc[3]

Yes    2
No     8
Name: 3, dtype: int64

In [66]:
df.iloc[1:4]

   Yes  No
1   21   2
2    3   6
3    2   8

In [69]:
df.iloc[2:4, 0]

2    3
3    2
Name: Yes, dtype: int64

In [71]:
df.describe()

             Yes          No
count   4.000000    4.000000
mean   19.000000   36.750000
std    22.435092   62.882828
min     2.000000    2.000000
25%     2.750000    5.000000
50%    12.000000    7.000000
75%    28.250000   38.750000
max    50.000000  131.000000

In [73]:
df['Yes'].describe()

count     4.000000
mean     19.000000
std      22.435092
min       2.000000
25%       2.750000
50%      12.000000
75%      28.250000
max      50.000000
Name: Yes, dtype: float64

In [74]:
df.min()

Yes    2
No     2
dtype: int64

In [75]:
df.max()

Yes     50
No     131
dtype: int64

In [76]:
df.mean()

Yes    19.00
No     36.75
dtype: float64

In [77]:
df.var()

Yes     503.333333
No     3954.250000
dtype: float64

In [78]:
df.std()

Yes    22.435092
No     62.882828
dtype: float64

In [81]:
df_csv.head()

  TravelDate  Passengers
0   1/1/1949         112
1   2/1/1949         118
2   3/1/1949         132
3   4/1/1949         129
4   5/1/1949         121

In [82]:
df_csv.Passengers.unique()

array([112, 118, 132, 129, 121, 135, 148, 136, 119, 104, 115, 126, 141,
       125, 149, 170, 158, 133, 114, 140, 145, 150, 178, 163, 172, 199,
       184, 162, 146, 166, 171, 180, 193, 181, 183, 218, 230, 242, 209,
       191, 194, 196, 236, 235, 229, 243, 264, 272, 237, 211, 201, 204,
       188, 227, 234, 302, 293, 259, 203, 233, 267, 269, 270, 315, 364,
       347, 312, 274, 278, 284, 277, 317, 313, 318, 374, 413, 405, 355,
       306, 271, 301, 356, 348, 422, 465, 467, 404, 305, 336, 340, 362,
       363, 435, 491, 505, 359, 310, 337, 360, 342, 406, 396, 420, 472,
       548, 559, 463, 407, 417, 391, 419, 461, 535, 622, 606, 508, 390,
       432])

In [87]:
df['Yes'].value_counts()

10    2
50    1
21    1
Name: Yes, dtype: int64

In [84]:
df_csv.Passengers.value_counts()

229    3
180    2
196    2
404    2
405    2
      ..
162    1
163    1
420    1
166    1
259    1
Name: Passengers, Length: 118, dtype: int64

In [85]:
df_csv.value_counts()

TravelDate  Passengers
9/1/1960    508           1
9/1/1959    463           1
2/1/1952    180           1
2/1/1951    150           1
2/1/1950    126           1
                         ..
5/1/1960    472           1
5/1/1959    420           1
5/1/1958    363           1
5/1/1957    355           1
1/1/1949    112           1
Length: 144, dtype: int64

In [88]:
df.value_counts()

Yes  No
50   131    1
21   2      1
10   8      1
     6      1
dtype: int64

In [90]:
df['Yes'].describe()

count     4.000000
mean     22.750000
std      18.892238
min      10.000000
25%      10.000000
50%      15.500000
75%      28.250000
max      50.000000
Name: Yes, dtype: float64